In [1]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [2]:
#Display top 3 rows of the dataset 
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [3]:
#last 3 rows of the dataset 
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#shape of the dataset 
df1.shape

(7, 3)

In [5]:
#total info about our dataset 
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [6]:
#check  null values in dataset 
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [7]:
#get overall statistics  
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [8]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [9]:
#unique values from the gender column 
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [10]:
#find the number of unique columns in gender column 
df1['Gender'].nunique()

2

In [11]:
#count of unique values in gender column 
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [12]:
#find the total number of students having msrks between 90 to 100 
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [13]:
df1[(df1['Marks']>=90 ) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [14]:
len(df1[(df1['Marks']>=90 ) & (df1['Marks']<=100)])

4

In [15]:
#using between method  
sum(df1['Marks'].between(90,100))

4

In [16]:
#find average marks 
df1['Marks'].mean()

92.14285714285714

In [17]:
#Apply method 
def marks(x):
    return x//2

In [18]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [19]:
df1['half_marks']=df1['Marks'].apply(marks)

In [20]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [22]:
#with lambda function 
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [23]:
#lenght of the string 
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [30]:
#map function 
#perform n-coding 
#converting male to 1 and female to 0 
df1['male_female']=df1['Gender'].map({'Male':1,'Female':0})

In [31]:
df1

      Name  Marks  Gender  half_marks  male_female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [29]:
#drop the columns 
#drop one column
df1.drop('male_female',axis=1)

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [34]:
#if we want to drop multiple columns we want to put column names in the list
df1.drop(columns=['male_female','half_marks'],axis=1,inplace=True)#inplace modify existing dataframe

In [35]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [36]:
#print name of the columns 
#columns is not a method it is a attribute of pandas dataframe
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [37]:
#display rows 
df1.index

RangeIndex(start=0, stop=7, step=1)

In [41]:
#sort the dataframe as per the marks column 
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [42]:
#sort the values as per marks column and gender 
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [48]:
#Display the name and marks of the female students 
df1[df1['Gender']=='Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [52]:
df1[df1['Gender']=='Female']['Name'] #to know the only name of female

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [54]:
df1[df1['Gender']=='Female'][['Name','Marks']] #to display the name and marks of female ---->for multiple columns

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [57]:
# we can also use isin method
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99